Database: testData/staedtetest
Restore : YES

Operator : createhash
Number   : 1
Signature: (((rel (tuple (x1 t1)...(xn tn)))) xi) -> (hash (tuple ((x1 t1)...(xn tn))) ti)
Example  : query Staedte createhash[SName]
Result   : file


Operator : createhash
Number   : 2
Signature: ((stream (tuple (x1 t1)...(xn tn) (id tid))) xi) -> (hash (tuple ((x1 t1)...(xn tn))) ti)
Example  : query Staedte feed extend[ID: tupleid(.)] sortby[SName asc] createhash[SName]
Result   : file


Operator : createhash
Number   : 3
Signature: ((stream (tuple (x1 t1)...(xn tn) (id tid))) xi) -> (hash (tuple ((x1 t1)...(xn tn))) ti)
Example  : query Staedte createhash[SName] Staedte exactmatch["Bremen"] count
Result   : 1


Operator : deletehash
Number   : 1
Signature: stream(tuple(x@[TID tid])) x (hash(tuple(x) ti) xi) -> stream(tuple(x@[TID tid]))]
Example  : query Staedte feed filter[.Bev < 200000] Staedte deletedirect staedte_SName_h deletehash[SName] staedte_Bev_h deletehash[Bev] consume
Result   : file


Operator : exactmatch
Number   : 1
Signature: ((hash (tuple ((x1 t1)...(xn tn))) ti)(rel (tuple ((x1 t1)...(xn tn)))) ti) -> (stream (tuple ((x1 t1)...(xn tn))))
Example  : query staedte_SName_h Staedte exactmatch["Dortmund"] count
Result   : 1


Operator : exactmatchS
Number   : 1
Signature: (hash( (tuple(X))) ti) ti->)(stream((id tid)))
Example  : query staedte_SName_h exactmatchS["Bochum"] Staedte gettuples consume
Result   : file


Operator : inserthash
Number   : 1
Signature: stream(tuple(x@[TID tid])) x (hash(tuple(x) ti) xi) -> stream(tuple(x@[TID tid]))]
Example  : query Kleinstaedte feed Staedte insert staedte_SName_h inserthash[SName] staedte_Bev_h inserthash[Bev] consume
Result   : file


Operator : updatehash
Number   : 1
Signature: stream(tuple(x@[(a1_old x1)...(an_old xn)(TID tid)])) x (hash(tuple(x) ti) xi) -> stream(tuple(x@[(a1_old x1)...(an_old xn)(TID tid)]))]
Example  : query Staedte feed filter [.SName = "Saarbruecken"] Staedte updatedirect [SName: "Saarbrï¿½cken"] staedte_Bev_h updatehash[Bev] staedte_SName_h updatehash[SName] count
Result   : 1

Operator : getFileInfo
Number   : 1
Signature: (hash(tuple(x) ti) xi) -> text
Example  : query isdefined(getFileInfo(staedte_Bev_h))
Result   : TRUE

