<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 2.0 for Windows">
	<META NAME="Author" Content="Linda Oxnard">
	<TITLE>Gu&iacute;a de introducci&oacute; a GeoTools para usuarios finales</TITLE>
</HEAD>

<BODY>

<H1>Gu&iacute;a de introducci&oacute;n a GeoTools para usuarios finales (versi&oacute;n 1.0)</H1>
<P>
<H2>Requisitos:</H2>
<P>Este documento no supone conocimientos previos de Java ni experiencia de SIG (GIS).<BR>
<BR>
Sin embargo, se precisa, al menos, algunos conocimientos de HTML para poder colocar mapas en tu sitio web y algunos
mapas propios, de ser posible en formato Shapefile ESRI (tm) (aunque se puede empezar con los datos contenidos
en los demos)
<H2>Como empezar:</H2>
<P>Primero, hace falta descargar la &uacute;ltima copia del paquete de ejemplos y demos de GeoTools. El fichero
se llama demos.zip. Se puede descargar de la <A HREF="http://geotools.org/dload.php">p&aacute;gina de descarga</A>.<BR>
<BR>
De momento, no te preocupes por los otros ficheros que se encuentran all&iacute;. S&oacute;lo los vas a necesitar
si decides seguir trabajando con GeoTools como un 'solution builder' (creador/a de soluciones) o como un desarrollador.<BR>
<BR>
Tambi&eacute;n necesitas un navegador que soporte Java 1.1, por ejemplo Netscape 4.06 o superior / Internet Explorer
5 o superior. (Si eliges descargar el navegador, ten en cuenta que deber&iacute;as elegir la opci&oacute;n de instalar
Java, ya que en algunas de las versiones recientes no se incluye por defecto).
<H2>Qu&eacute; puedo hacer con los ejemplos?</H2>
<P>Es de esperar que ya tengas una copia de demos.zip y un navegador 'java-permitido' (java-enabled). Ahora miramos
el proceso necesario para hacer funcionar los demos.<BR>
<BR>
Primero, descomprime el archivo zip utilizando tu descompresor preferido. Si no tienes acceso a ning&uacute;n programa
descompresor para descomprimir ficheros zip, env&iacute;a una <A HREF="http://sourceforge.net/tracker/?group_id=4091">solicitud
de soporte</A> y haremos todo lo posible para enviarte los ficheros de otro formato.<BR>
<BR>
Una vez descomprimido, ver&aacute;s un fichero llamado &quot;readme.html&quot; y un directorio llamado &quot;demonstrations&quot;.<BR>
<BR>
Abre el fichero readme.html en tu navegador y haz clic sobre 'view' (por debajo de ejemplo 1). Esta acci&oacute;n
abrir&aacute; una de las p&aacute;ginas de la cartera de demostraciones, la cual, despu&eacute;s de una pausa breve,
deber&iacute;a mostrar un mapa sencillo de Estados Unidos.<BR>
<BR>
Si el mapa no aparece, &eacute;chale un vistazo a la secci&oacute;n llamada 'trouble shooting' (resoluci&oacute;n
de problemas) al final de esta p&aacute;gina.<BR>
<BR>
Supongamos que ya tienes un mapa visualizado en la pantalla. Intenta utilizar los tres botones que aparecen en
la parte inferior del mapa. Haz clic en el bot&oacute;n 'zoom' y luego arrastra un rect&aacute;ngulo sobre una
regi&oacute;n del mapa. El mapa har&aacute; un zoom sobre la regi&oacute;n que has seleccionado. Haz clic en el
bot&oacute;n 'pan' y luego haz clic y mant&eacute;n presionado el bot&oacute;n izquierda del rat&oacute;n sobre
el mapa para arrastrarlo.<BR>
<BR>
Por &uacute;ltimo, haz clic en el bot&oacute;n 'reset'. As&iacute; ajustar&aacute;s la vista para que demuestre
el mapa completo de los EEUU.<BR>
<BR>
Puedes volver a la p&aacute;gina de readme.html y probar otros ejemplos si quieres ver m&aacute;s ejemplos de GeoTools
en acci&oacute;n.
<H3>Miremos los ficheros en m&aacute;s detalle:</H3>
<P>C&oacute;mo funcionan los demos arriba mencionados y qu&eacute; ficheros se utilizan para que funcionen?</P>
<P>Cada demo necesita 5 ficheros:</P>

<UL>
	<LI>un fichero 'HTML' - contiene todo lo que aparece en la p&aacute;gina web y proporciona informaci&oacute;n al
	applet que demostrar&aacute; el mapa.
	<LI>un fichero 'class' - controla la forma del mapa y sus controles
	<UL>
		<LI>geotools.jar - el fichero principal - proporciona todas las capacidades de cartografia
		<LI>collections.jar - una biblioteca de soporte, escrita por Sun, que est&aacute; utilizada por GeoTools
		<LI>support.jar - un fichero de soporte adicional
		<LI>un fichero 'zip' - contiene la informaci&oacute;n cartogr&aacute;fica que utiliza el applet de mapeo (map applet)
	</UL>
</UL>

<P>En el caso de ejemplo 1, los ficheros que se necesitan son:<BR>
<BR>
demonstrations\Example1.html <BR>
demonstrations\Example1.class <BR>
demonstrations\jars\geotools.jar <BR>
demonstrations\jars\support.jar<BR>
demonstrations\jars\collections.jar <BR>
demonstrations\maps\statepop.zip<BR>
<BR>
Si miramos cada fichero por separado, el primero es la p&aacute;gina web. Si lo abres en un editor ver&aacute;s
que, por la mayor parte, es como cualquier otra p&aacute;gina HTML. La parte interesante es la secci&oacute;n que
se encuentra entre las etiquetas 'applet':<BR>
<BR>
&lt;APPLET ARCHIVE=&quot;jars/geotools.jar,jars/support.jar,jars/collections.jar&quot; CODE=&quot;Example1.class&quot;
WIDTH=&quot;430&quot; HEIGHT=&quot;270&quot; ALIGN=&quot;BOTTOM&quot;&gt; <BR>
&lt;PARAM NAME=&quot;shapefile&quot; VALUE=&quot;maps/statepop&quot;&gt; <BR>
&lt;/APPLET&gt;<BR>
<BR>
Si miramos este c&oacute;digo detalladamente, vemos que lo primero que hace es declarar que se va a utilizar un
applet. La etiqueta 'archive' proporciona la posici&oacute;n de las dos bibliotecas de soporte - geotools.jar y
collections.jar. La etiqueta 'code' da nombre al fichero 'class' que se debe utilizar, mientras que las etiquetas
'width' (anchura), 'height' (altura) y 'align' (alineaci&oacute;n) indican qu&eacute; tan grande debe ser el applet.<BR>
<BR>
A continuaci&oacute;n, hay una etiqueta 'param'. &Eacute;ste es un par&aacute;metro que est&aacute; utilizado por
el applet. En este caso, se denomina 'shapefile' y toma el valor de la posici&oacute;n del fichero cartogr&aacute;fico
que se debe utilizar. F&iacute;jate que no se pone la extensi&oacute;n '.zip'.<BR>
<BR>
Por &uacute;ltimo, la etiqueta 'applet' se cierra y el resto de la p&aacute;gina es de html est&aacute;ndard.<BR>
<BR>
Los ficheros geotools.jar y collections.jar son ficheros de biblioteca, nada m&aacute;s, y son requeridos por cada
applet GeoTools. No es necesario cambiar nada.<BR>
<BR>
Si abres el fichero 'statepop.zip' usando un descompresor, ver&aacute;s que contiene tres ficheros: .shp, .shx
y .dbf. GeoTools s&oacute;lo precisa los ficheros .shp y .dbf., pero la mayor&iacute;a de los 'shapefiles' contienen
los tres, y es posible que versiones posteriores de GeoTools utilicen el fichero .shx (que es un &iacute;ndice),
as&iacute; que es recomendable tenerlo disponible.
<H2>Como colocar tu mapa en el web:</H2>
<P>Supongamos que tienes un 'shapefile' propio y que quieres colocarlo en un sitio web. C&oacute;mo lo haces?<BR>
<BR>
Empieza con ejemplo 1, ya que &eacute;ste es el mas f&aacute;cil de montar:<BR>
<BR>
Guarda una copia de Example1.html, llamada, por ejemplo, MiMapa.html.<BR>
Pon tus ficheros 'shapefile' en el directorio de mapas (o pon los tres ficheros all&iacute; por separados o compr&iacute;melos
en un s&oacute;lo fichero .zip).<BR>
<BR>
Cambia la etiqueta 'param' en MiMapa.html de manera que el valor equivalga al nombre y la posici&oacute;n de tu
'shapefile'.<BR>
<BR>
Abre la p&aacute;gina html en tu navegador y tu mapa debe aparecer.<BR>
<BR>
GeoTools no necesita ning&uacute;n soporte al lado del servidor, as&iacute; que, siempre que todos los ficheros
necesarios est&eacute;n colocados en tu sitio web, el mapa deber&iacute;a estar visualizado para que todos lo vean.
<H2>Como modificar los demos m&aacute;s avanzados:</H2>
<P><BR>
Los pr&oacute;ximos tres demos, ejemplos 2, 3 y 4, introducen cada uno caracter&iacute;sticas adicionales que hacen
parecer m&aacute;s interesantes los mapas.<BR>
<BR>
Ejemplo 2 a&ntilde;ade un par&aacute;metro que permite al mapa mostrar ToolTips (peque&ntilde;os carteles de ayuda
que aparecen en la pantalla y proporcionan informaci&oacute;n sobre alg&uacute;n que otra caracter&iacute;stica
cuando el puntero se deja sobre ella).<BR>
<BR>
Si miras la etiqueta 'applet' de Ejemplo 2, ver&aacute;s lo siguiente:<BR>
<BR>
&lt;APPLET ARCHIVE=&quot;jars/geotools.jar,jars/support.jar,jars/collections.jar&quot; CODE=&quot;Example2.class&quot;
WIDTH=&quot;430&quot; HEIGHT=&quot;270&quot; ALIGN=&quot;BOTTOM&quot;&gt; <BR>
&lt;PARAM NAME=&quot;shapefile&quot; VALUE=&quot;maps/statepop&quot;&gt; <BR>
&lt;PARAM NAME=&quot;tooltip&quot; VALUE=&quot;STATE_NAME&quot;&gt; <BR>
&lt;/APPLET&gt;<BR>
<BR>
El nuevo par&aacute;metro tiene el nombre 'tooltip' y su valor equivale al nombre de una columna de datos que se
puede encontrar en el fichero .dbf: en este caso, el nombre es, STATE_NAME.<BR>
<BR>
Si conoces el nombre de cualquiera de las columnas en el fichero .dbf de tu mapa, intenta cambiar este par&aacute;metro
para mostrar tooltips en tu mapa. Ten presente que, dentro de la etiqueta applet, el par&aacute;metro CODE tiene
el valor &quot;Example2.class&quot;. No es suficiente a&ntilde;adir una etiqueta param al fichero Example1.html,
ya que el applet no est&aacute; configurado para visualizarlos.<BR>
<BR>
Ejemplo 3, extiende el concepto de una manera similar. Esta vez, se usa el nombre de una columna num&eacute;rica,
y GeoTools lo utiliza para sombrear el mapa. En este caso, se usa la columna UNEMPLOY, que representa el desempleo
('unemployment' en ingl&eacute;s).<BR>
<BR>
&lt;APPLET ARCHIVE=&quot;jars/geotools.jar,jars/support.jar,jars/collections.jar&quot; CODE=&quot;Example3.class&quot;
WIDTH=&quot;430&quot; HEIGHT=&quot;270&quot; ALIGN=&quot;BOTTOM&quot;&gt; <BR>
&lt;PARAM NAME=&quot;shapefile&quot; VALUE=&quot;maps/statepop&quot;&gt; <BR>
&lt;PARAM NAME=&quot;shadeby&quot; VALUE=&quot;UNEMPLOY&quot;&gt; <BR>
&lt;PARAM NAME=&quot;tooltip&quot; VALUE=&quot;STATE_NAME&quot;&gt; <BR>
&lt;/APPLET&gt;<BR>
<BR>
Una caracter&iacute;stica interesante de este applet es que, si haces doble clic sobre la llave aparecer&aacute;
una caja que te permite cambiar la manera en que el mapa se sombrea.<BR>
<BR>
Otra vez, si conoces el nombre de una columna num&eacute;rica de tu shapefile, puedes cambiar las etiquetas 'param'
para que tu mapa se sombree utilizando estos datos.<BR>
<BR>
Ejemplo 4 no a&ntilde;ade ning&uacute;n par&aacute;metro nuevo, pero s&iacute; que incluye un 'widget' de control
adicional que hace posible cambiar los niveles de zoom.<BR>
<BR>
El demo final del paquete, en el momento de escribir estas l&iacute;neas, es el demo GraphApplet que muestra algunas
de las capacidades m&aacute;s interactivas de GeoTools. <BR>
<BR>
Mira las etiquetas param en este demo y a ver si logras entender como utilizar tus propios datos en el applet.
<H2>Como crear tus propios applets:</H2>
<P><BR>
Puede ser que est&aacute;s contento de utilizar uno de los applets del paquete de demos tal cual. Si es as&iacute;,
no tienes que hacer nada m&aacute;s. Basta con colocar los ficheros en un sitio web y publicar tus mapas. Pero
qu&eacute; pasa si ninguno de los applets hace precisamente lo que quieres? Tal vez quieras visualizar m&aacute;s
de una capa en el 'viewer', o te interese un otro tipo de interactividad, o quieras enlazar a otro tipo de gr&aacute;fico.
Si es as&iacute;, tienes 3 opciones:<BR>
<BR>
Primero, ve a la <A HREF="http://geotools.sourceforge.net/demos.php">p&aacute;gina de applets.</A></P>
<P>Se puede configurar a muchos de los applets que se encuentran all&iacute;, utilizando etiquetas param. Es posible
que hagan lo que necesitas.<BR>
<BR>
Si ninguno de los applets parece adecuado, la segunda opci&oacute;n que tienes es pedir que alguien, (quiz&aacute;s
nosotros), haga un applet personalizado que s&iacute; que est&eacute; adecuado. Si representas a una corporaci&oacute;n
adinerada que tiene un presupuesto que te quema las manos, puedes encargarnos que te preparamos una soluci&oacute;n
personalizada. Si no, es probable que uno de nosotros pueda ayudarte en el tiempo libre.<BR>
<BR>
La &uacute;ltima opci&oacute;n es de arriesgarte t&uacute; mismo/a y aprender un poco de Java para que puedas hacer
soluciones personalizadas tu mismo/a. Si quieres hacer eso, deber&iacute;as leer la pr&oacute;xima gu&iacute;a
de introducci&oacute;n para &quot;<A HREF="solutionBuilder.html">creadores de soluciones</A>&quot; (solution builders).
<H2>Resoluci&oacute;n de problemas y como buscar ayuda:</H2>
<P>Si ninguno de los applets hace lo que necesitas, puedes presentar una solicitud de soporte al sitio web de GeoTools
a SourceForge. Para facilitarnos las cosas, siempre dinos el sistema operativo que utilizas y la versi&oacute;n
del navegador. Si sabes como hacerlo, tambi&eacute;n nos ayudaria que nos envie una copia de cualquier mensaje
que aparezca en la consola Java de tu navegador.<BR>
<BR>
nb: Aunque los principales desarrolladores de GeoTools no entienden espa&ntilde;ol, la administradora del proyecto
s&iacute; que lo entiende, as&iacute; que, si no puedes enviar tus solicitudes de soporte en ingl&eacute;s pues
... hazlo en espa&ntilde;ol :) <BR>
<BR>
Para presentar una solicitud de soporte, ve a la p&aacute;gina principal del proyecto a: <BR>
<A HREF="http://sourceforge.net/projects/geotools/">http://sourceforge.net/projects/geotools/</A><BR>
<BR>
Elige la opci&oacute;n &quot;support&quot; de la lista que aparece a la parte superior de la p&aacute;gina. En
la pr&oacute;xima p&aacute;gina, elige &quot;submit&quot; .<BR>
<BR>
No hace falta ser miembro de SourceForge para poder utilizar este formulario. Sin embargo, si eres miembro de SourceForge
podr&aacute;s utilizar el sitio web para vigilar el progreso de tu solicitud.<BR>
<BR>
Elige &quot;getting started&quot; de la lista de categorias y luego danos un sumario de tu problema (y cualquier
otro detalle que te occurra).<BR>
<BR>
Si logras hacer funcionar algunos de los applets pero te causa problemas alg&uacute;n aspecto espec&iacute;fico
de ellos, o no puedes configurarlo todo como quieres, tienes dos opciones. La primera es de rellenar el formulario
&quot;solicitud de soporte&quot; arriba mencionado. La segunda es de mirar el archivo de la lista de distribuci&oacute;n
'geotools-discussion' para ver si el problema que tienes t&uacute; ya ha surgido antes. Si no es as&iacute;, puedes
darte de alta en la lista y enviar tu pregunta para que todos podamos darle vueltas.<BR>
<BR>
Para ver m&eacute;s detalles sobre el archivo de la lista de distribuci&oacute;n y para darte de alta, ve a <A
HREF="http://lists.sourceforge.net/lists/listinfo/geotools-discussion">geotools-discussion</A>.</P>
<P><FONT SIZE="2">Por fin, como a lo mejor te has dado cuenta, este documento ha sido traducido del ingl&eacute;s
por la administradora del proyecto, una inglesa, por quien, como es de esperar, el espa&ntilde;ol no es lengua
materna. Debe haber un mont&oacute;n de errores aqu&iacute; dentro y te agredecer&iacute;a de antemano que me avisara
de los errores m&aacute;s graves (sobre todo, los que podr&iacute;an causar confusi&oacute;n) a </FONT><A HREF="mailto:loxnard@users.sourceforge.net"><FONT
SIZE="2">loxnard at users.sourceforge.net</FONT></A><FONT SIZE="2">. &iexcl;Gracias!</FONT></P>
<P>
<HR ALIGN="CENTER">
</P>

<P><FONT SIZE="2">$header$</FONT>

</BODY>

</HTML>