<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>

<HEAD>
	<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
	<META NAME="GENERATOR" Content="Visual Page 2.0 for Windows">
	<META NAME="Author" Content="Linda Oxnard">
	<TITLE>untitled</TITLE>
</HEAD>

<BODY>

<H1>Gu&iacute;a de introducci&oacute;n a GeoTools para creadores de soluciones (versi&oacute;n 1.0)</H1>
<P>
<H2>Requisitos:</H2>
<P>Este documento introduce algunos elementos de programaci&oacute;n en Java y, mientras es posible que lo aprendas
sobre la marcha, quiz&aacute;s ser&iacute;a mejor buscar un buen tutorial si no tienes ninguna experiencia previa
de Java (al menos, ser&iacute;a &uacute;til saber crear un applet).</P>
<P>Tambi&eacute;n ser&iacute;a &uacute;til haber ojeado la gu&iacute;a para usuarios finales que sirve como una
introducci&oacute;n r&aacute;pida a los applets de GeoTools.</P>
<P>
<H2>Lo que necesitas:</H2>
<P>Deber&iacute;as descargar la copia m&aacute;s reciente del paquete de demos y ejemplos de GeoTools que se encuentra
en un fichero llamado demos.zip. En el momento de escribir estas l&iacute;neas, es la versi&oacute;n 1.1 y se puede
descargarlo desde la <A HREF="http://sourceforge.net/project/showfiles.php?group_id=4091">p&aacute;gina de descarga</A>
de GeoTools.</P>
<P>Descarga una copia del paquete 'geotools-docs' m&aacute;s reciente (incluso si lleva la extensi&oacute;n 'dev').
Si a&ntilde;ades <A HREF="http://geotools.sourceforge.net/docs">http://geotools.sourceforge.net/docs</A> a tus
favoritos, siempre podr&aacute;s encontrar una copia en l&iacute;nea de la documentaci&oacute;n API m&aacute;s
reciente. Sin embargo, te advertimos que a veces pueden ser documentadas ciertas caracter&iacute;sticas que ya
no estan disponibles en el paquete de 'ejemplos y demos' que has descargado.</P>
<P><BR>
Tambi&eacute;n tienes la opci&oacute;n de descargar una copia del c&oacute;digo fuente principal de GeoTools. Incluso
si no piensas modificarlo todavia, puede servir como una referencia muy &uacute;til cuando la documentaci&oacute;n
API resulte demasiado confusa para ayudarte. A veces, se pueden encontrar dos versiones del codigo fuente: una
versi&oacute;n normal y una versi&oacute;n para desarrolladores (dev). De momento, es mejor descargar la que tenga
la fecha m&aacute;s reciente.</P>
<P>Tambi&eacute;n necesitar&aacute;s un compilador de Java (versi&oacute;n 1.1 o superior).</P>
<P>Por fin, necesitar&aacute;s un navegador con soporte de Java 1.1: por ejemplo, Netscape 4.06 o superior / IE5
o superior. Si decargas el navegador, ten en cuenta que deber&iacute;as elegir la opci&oacute;n que incluye una
m&aacute;quina virtual Java (Java Virtual Machine), ya que en algunas de las versiones recientes no se incluye
por defecto).</P>
<P>
<H2>Como compilar un applet de GeoTools:</H2>
<P>Descomprime el archivo demos.zip y abre el fichero readme.html. Echa un vistazo a cada ejemplo (haz clic en
los enlaces). Para ver m&aacute;s detalles, echa un vistazo a la gu&iacute;a de introducci&oacute;n para usuarios
finales.</P>
<P>Si abres la carpeta de demostraciones, encontrar&aacute;s todos los ficheros y subdirectorios que est&aacute;n
utilizados por todos los demos con los que acabas de jugar. Por ejemplo, el primer demo utiliza:</P>
<P>Example1.html <BR>
Example1.class <BR>
jars\geotools.jar <BR>
jars\collections.jar <BR>
jars\support.jar <BR>
maps\statepop.zip</P>
<P>Adem&aacute;s de estos ficheros, hay un fichero llamado Example1.java. &Eacute;ste es el que nos interesa ahora,
ya que contiene el c&oacute;digo fuente del applet utilizado en Ejemplo1.</P>
<P>El primero que debes hacer es intentar compilar el applet, sin hacerle ninguna modificaci&oacute;n. Si todo
va bien y no ves ning&uacute;n error, podemos mirar como funciona el c&oacute;digo fuente.</P>
<P>Todo depende de tu entorno de desarrollo Java, pero es posible que tengas que cambiar la sentencia siguiente
(consulta la documentaci&oacute;n de tu compilador para mayor informaci&oacute;n).</P>
<P><CODE>javac -classpath jars/geotools.jar:jars/collections.jar Example1.java</CODE></P>
<P><CODE><BR>
</CODE>Con un poco de suerte, no aparecer&aacute; ningun mensaje de error, pero si no es as&iacute; y no entiendes
por qu&eacute;, haz una copia de los mensajes y env&iacute;a una <A HREF="http://sourceforge.net/tracker/?group_id=4091&atid=204091">solicitud
de soporte</A> (elige &quot;getting started&quot; de la lista de opciones). Cuantos m&aacute;s detalles nos facilite
sobre los errores, m&aacute;s f&aacute;cil nos ser&aacute; que te ayudemos. Si nos envias informaci&oacute;n adicional
sobre el sistema operativo y el entorno de desarrollo Java que utilizas, incluso mejor.</P>
<P>Como prueba final, intenta ejecutar el applet a ver si todavia funciona. O bien abre Example1.html en tu navegador
o utiliza 'appletviewer'.</P>
<P><CODE>appletviewer Example1.html</CODE></P>
<P>
<H2>Miremos el c&oacute;digo fuente de Ejemplo 1:</H2>
<P>Abre Example1.java en tu editor de textos favorito y mira el c&oacute;digo. Con un poco de suerte, los comentarios
del c&oacute;digo te dar&aacute;n algunas pistas sobre lo que sucede pero, de todas formas, tratar&eacute; los
puntos principales ahora (no incluyo los comentarios aqu&iacute; por razones de concisi&oacute;n).</P>
<P><CODE>import java.applet.*; <BR>
import java.awt.*; <BR>
import java.net.*; <BR>
import java.io.*; <BR>
<B>import uk.ac.leeds.ccg.geotools.*; <BR>
import uk.ac.leeds.ccg.widgets.ToolBar;</B></CODE></P>
<P>Las primeras cuatro l&iacute;neas contienen sentencias de importaci&oacute;n est&aacute;ndards de Java. Sin
embargo, las &uacute;ltimas dos importan clases espec&iacute;ficas a GeoTools: la principal biblioteca de GeoTools
y una clase llamada 'ToolBar' (barra de herramientas) de un paquete 'widgets' de soporte.</P>
<P><CODE>public class Example1 extends Applet <BR>
{ <BR>
Viewer view = new Viewer();</CODE></P>
<P><CODE><BR>
</CODE>La clase Viewer es el componente en el que se visualiza el mapa. En este caso, se construye una instancia
de Viewer llamada <B>view</B>. Como es l&oacute;gico, es una de las clases m&aacute;s importantes de GeoTools y,
si tienes el c&oacute;digo fuente disponible, ver&aacute;s que tambi&eacute;n es una de las m&aacute;s complejas.</P>
<P>De momento, no es necesario conocerlo a fondo, basta con saber que facilitar&aacute; el viewport (subdivisi&oacute;n
de pantalla) en el que el mapa se visualizar&aacute;.</P>
<P><CODE>public void init(){ <BR>
setLayout(new BorderLayout()); <BR>
add(view,&quot;Center&quot;); <BR>
ToolBar tools = new ToolBar(view); <BR>
add(tools,&quot;South&quot;); <BR>
}</CODE></P>
<P><BR>
El m&eacute;todo <B>init</B> de un applet se llama antes de que el applet se visualice, as&iacute; que el c&oacute;digo
que ves aqu&iacute; coloca los componentes del applet.</P>
<P>F&iacute;jate que se utiliza un <B>BorderLayout</B> y el objeto <B>view</B> se a&ntilde;ade al centro. &Eacute;sta
es una convenci&oacute;n muy &uacute;til ya que le permite al mapa redimensionarse hasta ocupar todo el espacio
disponible.</P>
<P>Ahora, ves como el objeto ToolBar (<B>tools</B>) se construye. Toma un 'Viewer' como argumento. Los 'widgets'
de ToolBar facilitan unos mandos muy &uacute;tiles que permiten interactuar con los viewers, as&iacute; que al
momento mismo de crearse, tienen que saber qu&eacute; viewer controlar&aacute;n. No hay nada milagroso en el 'widget'
de ToolBar y resulta bastante f&aacute;cil ignorarlo y crear tus propios mandos de interfaz si est&aacute;s familiarizado
con el AWT. Es posible que el c&oacute;digo fuente de ToolBar te de algunas pistas.</P>
<P><CODE>public void start(){ <BR>
try{ <BR>
loadMaps(); <BR>
} <BR>
catch(IOException e){ <BR>
this.showStatus(&quot;Error loading map file &quot;+e); <BR>
} <BR>
}</CODE></P>
<P><CODE><BR>
</CODE>En cuanto se carga el applet y termina el m&eacute;todo <B>init()</B>, se llama el m&eacute;todo <B>start()</B>.
Este m&eacute;todo no hace nada m&aacute;s que llamar a otro m&eacute;todo que carga todos los datos cartogr&aacute;ficos.</P>
<P>Se utiliza el bloque<B> try/catch</B> para capturar cualquier tipo de excepci&oacute;n que pueda occurir durante
el proceso de carga (puede que falte un fichero o exista un fichero corrupto).</P>
<P><CODE>public void loadMaps() throws IOException{ <BR>
String shapefile = this.getParameter(&quot;shapefile&quot;); <BR>
URL url = new URL(getCodeBase(),shapefile); <BR>
<BR>
ShapefileReader sfr = new ShapefileReader(url); <BR>
<BR>
Theme t = sfr.getTheme(); <BR>
view.addTheme(t); <BR>
}</CODE></P>
<P><CODE><BR>
</CODE>&Eacute;ste es el m&eacute;todo que carga los mapas y es invocado por el m&eacute;todo <B>start</B>. El
primero que hace es determinar el nombre y la posici&oacute;n del mapa a cargar (en este caso, se obtiene la informaci&oacute;n
desde una etiqueta 'param' del fichero html que acompa&ntilde;a al applet). Si miras el c&oacute;digo fuente de
Example1.html, encontrar&aacute;s una l&iacute;nea que dice &lt;param name=&quot;shapefile&quot; value=&quot;maps/statepop&quot;&gt;.
Es el valor de <B>maps/statepop</B> que se utiliza aqu&iacute;. Una vez recogida la informaci&oacute;n, se utiliza
para construir un URL completo.</P>
<P>Ahora, se crea un ShapefileReader (<B>sfr</B>) para sacar informaci&oacute;n del shapefile denominado. GeoTools
contiene un buen n&uacute;mero de clases 'Reader' que funcionan con varios formatos de fichero. Sin embargo, en
el momento de escribir estas l&iacute;neas, la clase ShapefileReader es la mas estable y bien soportada.</P>
<P>A continuaci&oacute;n, el ShapefileReader se utiliza para construir un objeto 'theme' (<B>t</B>) a partir de
los datos de que dispone. En GeoTools, los 'Themes' contienen toda la informaci&oacute;n relacionada con un conjunto
determinado de entidades geogr&aacute;ficas, incluyendo los colores, los datos de atributo, las etiquetas y las
entidades mismas. En realidad, los Themes no almacenan esta informaci&oacute;n de manera directa, sino que utilizan
una colecci&oacute;n de otros objetos, entre los cuales se destacan una capa (Layer) que contiene la geograf&iacute;a
misma, un objeto GeoData que contiene la informaci&oacute;n de atributo, un Shader (sombreador) que convierte los
valores GeoData en colores para efectuar el sombreado, un ShadeStyle (que controla como se pintan las entidades),
y unos cuantos m&aacute;s.</P>
<P>Sin embargo, lo importante es que ShapefileReader esconde todo esto y proporciona opciones predeterminadas a
todo lo arriba mencionado con la excepci&oacute;n del objeto Layer que es lo que construy&oacute; del shapefile
mismo.</P>
<P>Como ver&aacute;s en los demos posteriores, hay m&aacute;s opciones 'getTheme' y &eacute;stas ofrecen m&aacute;s
control sobre como se construye el Theme, pero a&uacute;n as&iacute;, puedes llamar m&eacute;todos sobre el objeto
theme mismo para cambiar su configuraci&oacute;n.</P>
<P>Por fin, el theme (<B>t</B>) se a&ntilde;ade al objeto 'view'. Hecho eso, todo lo dem&aacute;s est&aacute; en
autom&aacute;tico. GeoTools trazar&aacute; el mapa a escala, mientras el 'widget' de ToolBar maneja la selecci&oacute;n
de modos de 'zoom' y 'pan' para el viewer.</P>
<P>Los dem&aacute;s m&eacute;todos del applet s&oacute;lo facilitan informaci&oacute;n sobre el applet mismo y
no vienen al caso.</P>
<P>Es importante notar aqu&iacute; que el fichero que aparece en el documento html no lleva extensi&oacute;n alguna.
Esto es porque la extensi&oacute;n podr&iacute;a ser una de varias. Generalmente, los shapefiles est&aacute;n compuestos
de uno, dos, tres o m&aacute;s ficheros separados: un fichero .shp que contiene las entidades, un fichero .dbf
que contiene los datos de atributo y un fichero .shx que funciona como un &iacute;ndice. Ficheros adicionales proporcionan
m&aacute;s informaci&oacute;n de &iacute;ndice pero no se necesitan (de hecho, GeoTools puede funcionar sin el
.shx y incluso sin el .dbf). GeoTools da al usuario la opci&oacute;n de publicar estos ficheros en formato comprimido
as&iacute; que, al no especificar una extensi&oacute;n, GeoTools buscar&aacute; primero un fichero .zip y luego
todos los ficheros individuales.</P>
<P>
<H2>Miremos el c&oacute;digo de Ejemplo 2</H2>
<P>No tratar&eacute; todo el c&oacute;digo aqu&iacute; ya que casi todo es &iacute;dentico al ejemplo anterior,
as&iacute; que s&oacute;lo tratar&eacute; las nuevas l&iacute;neas del m&eacute;todo loadMaps, que es el &uacute;nico
que cambia. <BR>
<BR>
<CODE>String tooltip = this.getParameter(&quot;tooltip&quot;); <BR>
GeoData tips = sfr.readData(tooltip); <BR>
t.setTipData(tips);</CODE> <BR>
<BR>
Ejemplo 2 a&ntilde;ade tooltips al mapa (tooltips son los peque&ntilde;os carteles de ayuda que aparecen en la
pantalla y proporcionan informaci&oacute;n sobre alg&uacute;n que otra caracter&iacute;stica cuando el puntero
se deja sobre ella).</P>
<P>Para crearlos, se necesita una etiqueta 'param' adicional en el fichero html del applet. Se deber&iacute;a darle
el nombre de una columna del fichero .dbf.</P>
<P>Si no sabes qu&eacute; columnas existen en tu fichero .dbf, tienes algunas opciones. O bien podr&iacute;as abrir
el fichero .dbf dentro de una aplicaci&oacute;n (Excel, StarOffice, o incluso ArcView si tienes una copia), o bien
podr&iacute;as utilizar el comando appletviewer para ejecutar Ejemplo 1 (si haces esto, te debe aparecer en la
pantalla algo parecido a lo siguiente:</P>
<P><CODE>Found .dbf in zip file <BR>
Loaded as STATE_NAME <BR>
Loaded as STATE_FIPS <BR>
Loaded as SUB_REGION <BR>
Loaded as STATE_ABBR <BR>
Loaded as LAND_KM <BR>
Loaded as WATER_KM <BR>
Loaded as PERSONS <BR>
Loaded as FAMILIES <BR>
...</CODE></P>
<P><BR>
Cada una de estas l&iacute;neas representa una columna del fichero .dbf.</P>
<P>Se utiliza el 'shapefile reader' para extraer la columna denominada del fichero .dbf y empaquetarla en un objeto
GeoData, los contenidos del cual se utilizan para crear los 'tooltips'. En realidad, GeoData es una interfaz muy
sencilla que define un fuente de datos capaz de enlazar valores ID con valores de datos. En la mayoria de los casos,
esto quiere decir que cada entidad de una capa tiene un ID (identificaci&oacute;n) que puede enlazarse con un valor
de datos a trav&eacute;s de llamadas a un objeto GeoData. Normalmente, el enlace es transparente ya que el objeto
Theme se encarga de ello (que es lo que pasa en la &uacute;ltima l&iacute;nea del nuevo c&oacute;digo). Se llama
el m&eacute;todo <B>setTipData(</B>GeoData<B>)</B> de 'theme' para almacenar la informaci&oacute;n de los tooltips
(el 'tip data') junto con las entidades geogr&aacute;ficas.</P>
<P>A parte de estas tres l&iacute;neas y el cambio que se hace al fichero html, no hacen falta m&aacute;s modificaciones.</P>
<P>
<H2>Miremos el c&oacute;digo de Ejemplo 3</H2>
<P>Ejemplo 3 a&ntilde;ade, por fin, el color al mapa. Otra vez, este ejemplo se limita a a&ntilde;adir m&aacute;s
funcionalidad a los primeros dos ejemplos, as&iacute; que s&oacute;lo tratar&eacute; las nuevas l&iacute;neas.</P>
<P><CODE>public class Example3 extends Applet <BR>
{ <BR>
Viewer view = new Viewer(); <BR>
Panel keys = new Panel();</CODE></P>
<P>Cuando a&ntilde;ades color al mapa, es importante proporcionar una llave. El 'panel' que contiene la llave se
crea aqu&iacute;.</P>
<P><CODE>public void init(){ <BR>
... <BR>
add(keys,&quot;East&quot;); <BR>
... <BR>
}</CODE></P>
<P>La l&iacute;nea adicional del m&eacute;todo <B>init()</B> determina donde queremos que se coloque la llave.</P>
<P><CODE>Public void loadMaps() throws IOException{ <BR>
... <BR>
String shadeby = this.getParameter(&quot;shadeby&quot;); //Este valor deber&iacute;a corresponder al nombre de
una columna del fichero .dbf</CODE></P>
<P>Se necesita otra etiqueta 'param': esta vez para declarar de qu&eacute; columna se deber&iacute;a extraer los
datos relacionados al sombreado. <BR>
<BR>
<CODE>GeoData shadeData = sfr.readData(shadeby);</CODE></P>
<P>Los datos se extraen del mismo modo en que se extrajeron los datos 'tooltip' del ejemplo anterior. <BR>
<BR>
<CODE>Shader shade = new ClassificationShader(shadeData,6,ClassificationShader.QUANTILE,Color.green,Color.orange);</CODE></P>
<P>Los objetos 'Shader' representan otro componente importante de GeoTools. La 'Shader interface' (interfaz de
sombreo) es, en realidad, una interfaz muy sencilla que declara que las instancias deber&iacute;an poder devolver
un color por cualquier valor. El ClassificationShader es una implementaci&oacute;n bastante compleja del Shader
Interface que puede dividir una serie de n&uacute;meros en 'bins' y vincular un color con cada 'bin'. En este ejemplo,
crea los 'bins' a partir de unos datos que se encuentran en shadeData (se crear&aacute;n seis 'bins' a partir de
un algoritmo quantile). El primer bin ser&aacute; de color verde, el &uacute;ltimo bin se sombrear&aacute; de color
naranja, mientras que los dem&aacute;s bins ser&aacute;n de colores intermedios).</P>
<P><CODE>Theme t = sfr.getTheme();</CODE></P>
<P>El objeto 'theme' se construye tal como se hizo antes. <BR>
<BR>
<CODE>t.setShader(shade); <BR>
t.setGeoData(shadeData);</CODE></P>
<P>Estas dos l&iacute;neas configuran el 'theme' para que utilice el shader (sombreador) construido antes y para
que utilice el objeto shadeData para valores de entidades. Es importante tener en cuenta que no basta con pasar
shadeData al ClassificationShader arriba mencionado. Tambi&eacute;n se deber&iacute;a pasarlo al 'theme' como ilustrado.</P>
<P>Hay una serie de razones que explican lo anterior. Una de ellas es que no todos los shaders necesitan un objeto
GeoData para construirse. Otra es que no es obligatorio pasar el mismo objeto GeoData al shader que al theme (aunque,
en la mayoria de los casos, es precisamente lo que har&aacute;s). <BR>
<BR>
<CODE>keys.add(shade.getKey());</CODE></P>
<P>Por fin, pides la llave (Key) al shader y la a&ntilde;ades al panel que construimos antes.</P>
<P>
<H2>&iquest;Y ahora qu&eacute;?</H2>
<P>Bueno, ahora sabes compilar un applet y sabes como funcionan tres applets sencillos. &iquest;Ahora qu&eacute;
haces?</P>
<P>Pues, de momento hay dos ejemplos m&aacute;s en el paquete de demos (aunque Ejemplo 4 s&oacute;lo ilustra como
se a&ntilde;ade un widget de 'zoom control' sencillo). De otro lado, GraphApplet a&ntilde;ade toda una serie de
caracter&iacute;sticas y, lo que es muy importante, introduce el concepto de HighlightManagers.</P>
<P>GraphApplet deber&iacute;a tener su propio tutorial, pero, hasta que se escriba, a ver si llegas a entenderlo
lo a partir del c&oacute;digo fuente.</P>
<P>Si buscas algunos ejercicios pr&aacute;cticos, podr&iacute;as intentar modificar el programa para que se carge
m&aacute;s de un mapa al viewer, o podr&iacute;as intentar hacer funcionar otro de los shaders (sombreadores).
Vale la pena echarles un vistazo a MonoShader y HSVShader.</P>
<P>Si te gusta aprender al estudiar el codigo fuente, echa un ojo a la lista de demos en l&iacute;nea ya que un
buen numero de estos tienen el c&oacute;digo fuente disponible. <A HREF="http://geotools.sourceforge.net/demos.php">http://geotools.sourceforge.net/demos.php</A></P>
<P>En particular, podr&iacute;as mirar el demo 'Village' (pueblo).</P>
<P>Adem&aacute;s de esta gu&iacute;a de introducci&oacute;n, esperamos publicar gu&iacute;as adicionales sobre
algunos temas espec&iacute;ficos (como por ejemplo 'Highlight managers', 'Selection managers', 'Style objects'
y 'Layer types' especiales).</P>
<P>
<H2>Pero GeoTools no hace X</H2>
<P>Si encuentras que, por mucho que estudias los ejemplos disponibles y la documentaci&oacute;n API, no localizas
una caracter&iacute;stica concreta que necesitas desesperadamente, tienes dos opciones posibles.</P>
<P>Primero, puedes enviarnos una solicitud de soporte. Siempre respondemos a las solicitudes de los usuarios si
&eacute;sas son realistas, sobre todo si resultar&iacute;an &uacute;tiles para una amplia gama de usuarios. Desde
luego, si puedes ofrecernos un incentivo financiero para desarrollar la caracter&iacute;stica requirida, podemos
tratarlo como una prioridad urgente.</P>
<P>Segundo, puedes darte de alta en la lista de distribuci&oacute;n <A HREF="http://lists.sourceforge.net/lists/listinfo/geotools-discussion">geotools-discussion</A>
a ver si alguien ya esta desarrollando la caracter&iacute;stica que buscas o si est&aacute;n preparados a crearla
(con o sin tu ayuda).</P>
<P>Por fin, desde luego, puedes arriesgarte tu mismo/a y desarrollar las caracter&iacute;sticas adicionales tu
mismo/a. Si eres un programador competente, &eacute;chale un vistazo a la <A HREF="developer.html">gu&iacute;a
de introducci&oacute;n para desarrolladores</A> (disponible de momento s&oacute;lo en ingl&eacute;s) y empieza.</P>
<P>
<H2>Resoluci&oacute;n de problemas y como buscar ayuda</H2>
<P>Si te quedas atascado en algun aspecto t&eacute;cnico de GeoTools nada m&aacute;s empezado y resulta que no
puedes avanzar, se ruega enviarnos una solicitud de soporte.</P>
<P>nb: Aunque los principales desarrolladores de GeoTools no entienden espa&ntilde;ol, la administradora del proyecto
s&iacute; que lo entiende, as&iacute; que, si no puedes enviar tus solicitudes de soporte en ingl&eacute;s pues
... hazlo en espa&ntilde;ol y ella se asegurar&aacute; de que reciban una traducci&oacute;n de tu mensaje cu&aacute;nto
antes - lo m&aacute;s probable es que lo haga el dia mismo de su recepci&oacute;n :)</P>
<P>Para enviar una solicitud de soporte, ve a la p&aacute;gina principal del proyecto a:</P>
<P><A HREF="http://sourceforge.net/projects/geotools/">http://sourceforge.net/projects/geotools/</A></P>
<P>Elige la opci&oacute;n 'support' que aparece a la parte superior de la p&aacute;gina. En la pr&oacute;xima p&aacute;gina,
elige &quot;submit&quot;.</P>
<P>No hace falta ser miembro de SourceForge para poder utilizar este formulario. Sin embargo, si eres miembro de
SourceForge podr&aacute;s utilizar el sitio web para vigilar el progreso de tu solicitud.<BR>
<BR>
Elige &quot;getting started&quot; de la lista de categorias y luego danos un sumario del problema (y cualquier
otro detalle que te occurra).</P>
<P>Si logras empezar pero te gustar&iacute;a recibir m&aacute;s consejos sobre como aconseguir un setup espec&iacute;fico,
o m&aacute;s detalles sobre como funciona una caracter&iacute;stica concreta, env&iacute;anos una solicitud de
soporte o, incluso mejor, date de alta en la lista de distribuci&oacute;n <A HREF="http://lists.sourceforge.net/lists/listinfo/geotools-discussion">geotools-discussion</A>
y env&iacute;a tus preguntas all&iacute; (as&iacute; tendr&aacute;s la atenci&oacute;n de todos los desarrolladores
y una amplia gama de usuarios y tal vez alguno de ellos ya haya intentado hacer lo que quieres hacer t&uacute;).</P>
<P>Para ver m&aacute;s detalles sobre el archivo de la lista de distribuci&oacute;n y para darte de alta, ve a:
<A HREF="http://lists.sourceforge.net/lists/listinfo/geotools-discussion">geotools-discussion.</A></P>
<P><FONT SIZE="2">Por fin, como a lo mejor te has dado cuenta, este documento ha sido traducido del ingl&eacute;s
por la administradora del proyecto, una inglesa, por quien, como es de esperar, el espa&ntilde;ol no es lengua
materna. Debe haber un mont&oacute;n de errores aqu&iacute; dentro y te agredecer&iacute;a de antemano que me avisara
de los errores m&aacute;s graves (sobre todo, los que podr&iacute;an causar confusi&oacute;n) a </FONT><A HREF="mailto:loxnard@users.sourceforge.net"><FONT
SIZE="2">loxnard at users.sourceforge.net</FONT></A><FONT SIZE="2">. &iexcl;Gracias!</FONT></P>
<P>
<HR ALIGN="CENTER">
</P>

<P><FONT SIZE="2">$header$</FONT>

</BODY>

</HTML>